spring-ws-core/src/test/resources/org/springframework/ws/soap/addressing/200408/request-fault-to-mailto.xml

<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"
            xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
    <S:Header>
        <wsa:MessageID>http://example.com/someuniquestring</wsa:MessageID>
        <wsa:ReplyTo>
            <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
        </wsa:ReplyTo>
        <wsa:FaultTo>
            <wsa:Address>mailto:client@example.com</wsa:Address>
        </wsa:FaultTo>
        <wsa:To S:mustUnderstand="true">mailto:fabrikam@example.com</wsa:To>
        <wsa:Action>http://example.com/fabrikam/mail/Delete</wsa:Action>
    </S:Header>
    <S:Body>
        <f:Delete xmlns:f="http://example.com/fabrikam">
            <f:maxCount>42</f:maxCount>
        </f:Delete>
    </S:Body>
</S:Envelope>
